In [10]:
import pandas as pd
import numpy as np

## Group By: extraer valor de variables n√∫mericas

In [11]:
pd.options.display.float_format = '{:,.3f}'.format       #No de decimales que queremos que aparezcan usando pandas

In [12]:
import seaborn as sns

In [13]:
df = sns.load_dataset('tips')
df.head(5)

   total_bill   tip     sex smoker  day    time  size
0      16.990 1.010  Female     No  Sun  Dinner     2
1      10.340 1.660    Male     No  Sun  Dinner     3
2      21.010 3.500    Male     No  Sun  Dinner     3
3      23.680 3.310    Male     No  Sun  Dinner     2
4      24.590 3.610  Female     No  Sun  Dinner     4

In [14]:
df.describe(include='all')

        total_bill     tip   sex smoker  day    time    size
count      244.000 244.000   244    244  244     244 244.000
unique         nan     nan     2      2    4       2     nan
top            nan     nan  Male     No  Sat  Dinner     nan
freq           nan     nan   157    151   87     176     nan
mean        19.786   2.998   NaN    NaN  NaN     NaN   2.570
std          8.902   1.384   NaN    NaN  NaN     NaN   0.951
min          3.070   1.000   NaN    NaN  NaN     NaN   1.000
25%         13.348   2.000   NaN    NaN  NaN     NaN   2.000
50%         17.795   2.900   NaN    NaN  NaN     NaN   2.000
75%         24.127   3.562   NaN    NaN  NaN     NaN   3.000
max         50.810  10.000   NaN    NaN  NaN     NaN   6.000

In [15]:
df['day'].value_counts()

Sat     87
Sun     76
Thur    62
Fri     19
Name: day, dtype: int64

In [16]:
df['day'].value_counts() / len(df['day']) * 100    #len(df.day) es igual a shape[0]

Sat    35.656
Sun    31.148
Thur   25.410
Fri     7.787
Name: day, dtype: float64

In [17]:
df.groupby('sex').mean()

        total_bill   tip  size
sex
Male        20.744 3.090 2.631
Female      18.057 2.833 2.460

In [18]:
df['prct_tip'] = df['tip']/df['total_bill']
df.head()

   total_bill   tip     sex smoker  day    time  size  prct_tip
0      16.990 1.010  Female     No  Sun  Dinner     2     0.059
1      10.340 1.660    Male     No  Sun  Dinner     3     0.161
2      21.010 3.500    Male     No  Sun  Dinner     3     0.167
3      23.680 3.310    Male     No  Sun  Dinner     2     0.140
4      24.590 3.610  Female     No  Sun  Dinner     4     0.147

In [19]:
df.groupby('sex').mean()        #promedio de % de propinas

        total_bill   tip  size  prct_tip
sex
Male        20.744 3.090 2.631     0.158
Female      18.057 2.833 2.460     0.166

In [20]:
df.groupby('sex').median()      #mediana de % de propinas para evitar los outliers(valores at√≠picos)

        total_bill   tip  size  prct_tip
sex
Male        18.350 3.000     2     0.153
Female      16.400 2.750     2     0.156

In [21]:
df.groupby('sex')[['total_bill','prct_tip']].describe()    #Descripci√≥n de dos columnas por el groupby de sex

       total_bill                                                prct_tip  \
            count   mean   std   min    25%    50%    75%    max    count
sex
Male      157.000 20.744 9.246 7.250 14.000 18.350 24.710 50.810  157.000
Female     87.000 18.057 8.009 3.070 12.750 16.400 21.520 44.300   87.000


        mean   std   min   25%   50%   75%   max
sex
Male   0.158 0.065 0.036 0.121 0.153 0.186 0.710
Female 0.166 0.054 0.056 0.140 0.156 0.194 0.417

In [22]:
def mean_eur2usd(x):        #Funcion normal 
    y = np.mean(x)*1.12
    return y

In [23]:
mean_eur2usd([100,102])

113.12

In [24]:
df.groupby('sex')[['total_bill','prct_tip']].apply(mean_eur2usd)   #Agrupado por la columna sex y sacando el promedio de dos columnas numericas

        total_bill  prct_tip
sex
Male        23.233     0.177
Female      20.224     0.186

In [27]:
df.groupby('sex')[['total_bill','prct_tip']].apply(lambda x: np.mean(x) * 1.12)    #Funcion lambda

        total_bill  prct_tip
sex
Male        23.233     0.177
Female      20.224     0.186

In [28]:
df.groupby(['sex','time'])[['total_bill','prct_tip']].apply(mean_eur2usd)  #Aprupado por dos columnas y sacando el promedio de otras dos

               total_bill  prct_tip
sex    time
Male   Lunch       20.214     0.186
       Dinner      24.037     0.174
Female Lunch       18.300     0.182
       Dinner      21.519     0.190

In [29]:
df.groupby(['sex','time'])[['total_bill','prct_tip']].apply(np.std)       #Se aplican tambien funciones directas de Numpy

               total_bill  prct_tip
sex    time
Male   Lunch        7.832     0.045
       Dinner       9.423     0.069
Female Lunch        7.393     0.034
       Dinner       8.123     0.063

In [30]:
df.groupby(['sex','time'])[['total_bill','prct_tip']].apply(lambda x: np.mean(x)*1.12)

               total_bill  prct_tip
sex    time
Male   Lunch       20.214     0.186
       Dinner      24.037     0.174
Female Lunch       18.300     0.182
       Dinner      21.519     0.190

In [31]:
df.groupby(['sex','time'])[['total_bill','prct_tip']].aggregate([np.mean,np.max])  #Si queremos que nos traiga mas funciones como mean o max, usamos aggregate

              total_bill        prct_tip
                    mean   amax     mean  amax
sex    time
Male   Lunch      18.048 41.190    0.166 0.266
       Dinner     21.461 50.810    0.155 0.710
Female Lunch      16.339 43.110    0.162 0.259
       Dinner     19.213 44.300    0.169 0.417

In [32]:
df.groupby(['sex','time'])[['total_bill','prct_tip']].agg([np.mean,np.max])

              total_bill        prct_tip
                    mean   amax     mean  amax
sex    time
Male   Lunch      18.048 41.190    0.166 0.266
       Dinner     21.461 50.810    0.155 0.710
Female Lunch      16.339 43.110    0.162 0.259
       Dinner     19.213 44.300    0.169 0.417

In [33]:
dict_agg = {'tip':[min, max],'total_bill':[np.mean, mean_eur2usd]}    #Hacemos agregaciones con diccionarios de funciones 
dict_agg

{'tip': [<function min>, <function max>],
 'total_bill': [<function numpy.mean(a, axis=None, dtype=None, out=None, keepdims=<no value>)>,
  <function __main__.mean_eur2usd(x)>]}

In [34]:
df.groupby(['sex','time'])[['total_bill','tip']].agg(dict_agg)

                tip        total_bill
                min    max       mean mean_eur2usd
sex    time
Male   Lunch  1.440  6.700     18.048       20.214
       Dinner 1.000 10.000     21.461       24.037
Female Lunch  1.250  5.170     16.339       18.300
       Dinner 1.000  6.500     19.213       21.519

In [35]:
def f_filter(x):             #Se hace una funci√≥n para filtrar la agrupaci√≥n anterior, se aplica solo sobre la columna de total_bill
    return mean_eur2usd(x['total_bill'].mean()) > 20

In [36]:
df_filtered = df.groupby(['sex','time']).filter(f_filter)        #El unico prom que no se encuentra es el lunch de female (esta abajo de 20)
df_filtered

     total_bill   tip     sex smoker   day    time  size  prct_tip
0        16.990 1.010  Female     No   Sun  Dinner     2     0.059
1        10.340 1.660    Male     No   Sun  Dinner     3     0.161
2        21.010 3.500    Male     No   Sun  Dinner     3     0.167
3        23.680 3.310    Male     No   Sun  Dinner     2     0.140
4        24.590 3.610  Female     No   Sun  Dinner     4     0.147
..          ...   ...     ...    ...   ...     ...   ...       ...
239      29.030 5.920    Male     No   Sat  Dinner     3     0.204
240      27.180 2.000  Female    Yes   Sat  Dinner     2     0.074
241      22.670 2.000    Male    Yes   Sat  Dinner     2     0.088
242      17.820 1.750    Male     No   Sat  Dinner     2     0.098
243      18.780 3.000  Female     No  Thur  Dinner     2     0.160

[209 rows x 8 columns]

In [37]:
df_filtered.groupby(['sex','time']).count()       #Validaci√≥n del filtro anterior |

               total_bill     tip  smoker     day    size  prct_tip
sex    time
Male   Lunch       33.000  33.000  33.000  33.000  33.000    33.000
       Dinner     124.000 124.000 124.000 124.000 124.000   124.000
Female Lunch          nan     nan     nan     nan     nan       nan
       Dinner      52.000  52.000  52.000  52.000  52.000    52.000

## Group By: extraer valor con variables categ√≥ricas

In [38]:
df

     total_bill   tip     sex smoker   day    time  size  prct_tip
0        16.990 1.010  Female     No   Sun  Dinner     2     0.059
1        10.340 1.660    Male     No   Sun  Dinner     3     0.161
2        21.010 3.500    Male     No   Sun  Dinner     3     0.167
3        23.680 3.310    Male     No   Sun  Dinner     2     0.140
4        24.590 3.610  Female     No   Sun  Dinner     4     0.147
..          ...   ...     ...    ...   ...     ...   ...       ...
239      29.030 5.920    Male     No   Sat  Dinner     3     0.204
240      27.180 2.000  Female    Yes   Sat  Dinner     2     0.074
241      22.670 2.000    Male    Yes   Sat  Dinner     2     0.088
242      17.820 1.750    Male     No   Sat  Dinner     2     0.098
243      18.780 3.000  Female     No  Thur  Dinner     2     0.160

[244 rows x 8 columns]

In [39]:
df['ones'] = 1            #Se crea una columna con valores 1s para poder hacer un conteo

In [40]:
df

     total_bill   tip     sex smoker   day    time  size  prct_tip  ones
0        16.990 1.010  Female     No   Sun  Dinner     2     0.059     1
1        10.340 1.660    Male     No   Sun  Dinner     3     0.161     1
2        21.010 3.500    Male     No   Sun  Dinner     3     0.167     1
3        23.680 3.310    Male     No   Sun  Dinner     2     0.140     1
4        24.590 3.610  Female     No   Sun  Dinner     4     0.147     1
..          ...   ...     ...    ...   ...     ...   ...       ...   ...
239      29.030 5.920    Male     No   Sat  Dinner     3     0.204     1
240      27.180 2.000  Female    Yes   Sat  Dinner     2     0.074     1
241      22.670 2.000    Male    Yes   Sat  Dinner     2     0.088     1
242      17.820 1.750    Male     No   Sat  Dinner     2     0.098     1
243      18.780 3.000  Female     No  Thur  Dinner     2     0.160     1

[244 rows x 9 columns]

In [41]:
df_g = df.groupby(['sex','smoker'])[['ones']].sum()
df_g

               ones
sex    smoker
Male   Yes       60
       No        97
Female Yes       33
       No        54

In [42]:
df_g.groupby(level=0).apply(lambda x:x / x.sum() * 100)        #Para sacar el % de la tabla anterior, level=0(sex), 60/60+97*100

                ones
sex    smoker
Male   Yes    38.217
       No     61.783
Female Yes    37.931
       No     62.069

In [46]:
pd.cut(df['total_bill'],bins = 3).value_counts()   #Partir en segmentos una variable num y convertirla en categorica

(3.022, 18.983]     140
(18.983, 34.897]     88
(34.897, 50.81]      16
Name: total_bill, dtype: int64

In [47]:
pd.cut(df['total_bill'],bins = [3,18,35,60]).value_counts()     #Tambien se peude partir por medio de una lista de rangos

(3, 18]     127
(18, 35]    101
(35, 60]     16
Name: total_bill, dtype: int64

In [50]:
df['bin_total'] = pd.cut(df['total_bill'],bins = [3,18,35,60])      #O se puede poner bins=3  
df.head()

,total_bill,tip,sex,smoker,day,time,size,prct_tip,ones,bin_total
0,16.990,1.010,Female,No,Sun,Dinner,2,0.059,1,"(3, 18]"
1,10.340,1.660,Male,No,Sun,Dinner,3,0.161,1,"(3, 18]"
2,21.010,3.500,Male,No,Sun,Dinner,3,0.167,1,"(18, 35]"
3,23.680,3.310,Male,No,Sun,Dinner,2,0.140,1,"(18, 35]"
4,24.590,3.610,Female,No,Sun,Dinner,4,0.147,1,"(18, 35]"

In [56]:
df.groupby(['time','bin_total'])[['ones']].count()

                  ones
time   bin_total
Lunch  (3, 18]      45
       (18, 35]     21
       (35, 60]      2
Dinner (3, 18]      82
       (18, 35]     80
       (35, 60]     14

In [46]:
df.groupby(['time','bin_total'])[['ones']].count().groupby(level=0).apply(lambda x: x / x.sum() * 100)  #Convertimos a % (45/45+21+2)*100 =66.17

                   ones
time   bin_total
Lunch  (3, 18]   66.176
       (18, 35]  30.882
       (35, 60]   2.941
Dinner (3, 18]   46.591
       (18, 35]  45.455
       (35, 60]   7.955

## Pivot  (Tablas din√°micas)

In [58]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,prct_tip,ones,bin_total
0,16.990,1.010,Female,No,Sun,Dinner,2,0.059,1,"(3, 18]"
1,10.340,1.660,Male,No,Sun,Dinner,3,0.161,1,"(3, 18]"
2,21.010,3.500,Male,No,Sun,Dinner,3,0.167,1,"(18, 35]"
3,23.680,3.310,Male,No,Sun,Dinner,2,0.140,1,"(18, 35]"
4,24.590,3.610,Female,No,Sun,Dinner,4,0.147,1,"(18, 35]"

In [59]:
df.groupby(['sex','time'])[['total_bill']].mean()

               total_bill
sex    time
Male   Lunch       18.048
       Dinner      21.461
Female Lunch       16.339
       Dinner      19.213

In [63]:
df_gp = df.groupby(['sex','time'])[['total_bill']].mean().reset_index()      #Se convieerte en un df normal con un indice 
df_gp

      sex    time  total_bill
0    Male   Lunch      18.048
1    Male  Dinner      21.461
2  Female   Lunch      16.339
3  Female  Dinner      19.213

In [82]:
df_gp.pivot_table(values='total_bill', index='sex', columns='time')  #Se puede hacer directamente desde el df principal (y usando aggfunc= 'count')

time    Lunch  Dinner
sex
Male   18.048  21.461
Female 16.339  19.213

![](https://pandas-docs.github.io/pandas-docs-travis/_images/reshaping_pivot.png)

In [86]:
df.pivot_table(values='total_bill', index='sex', columns='time')           #Ahora se aplica en el df completo, (aggfunc= 'sum')

time    Lunch  Dinner
sex
Male   18.048  21.461
Female 16.339  19.213

In [54]:
df.pivot_table(values='total_bill', index='sex', columns='time', aggfunc=np.median)

time    Lunch  Dinner
sex
Male   16.580  19.630
Female 13.420  17.190

In [55]:
df_pivot = df.pivot_table(values='total_bill', index='sex', columns='time', aggfunc=[np.median,np.std])    #Sacando dos funciones 
df_pivot

       median          std
time    Lunch Dinner Lunch Dinner
sex
Male   16.580 19.630 7.953  9.461
Female 13.420 17.190 7.501  8.202

In [56]:
df_pivot.unstack().reset_index()      #Para desagrupar y volver a la tabla pivot, en un df normalizado

  level_0    time     sex      0
0  median   Lunch    Male 16.580
1  median   Lunch  Female 13.420
2  median  Dinner    Male 19.630
3  median  Dinner  Female 17.190
4     std   Lunch    Male  7.953
5     std   Lunch  Female  7.501
6     std  Dinner    Male  9.461
7     std  Dinner  Female  8.202